{
  "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#authenticationMethodConfigurations/$entity",
  "@odata.type": "#microsoft.graph.microsoftAuthenticatorAuthenticationMethodConfiguration",
  "id": "MicrosoftAuthenticator",
  "state": "enabled",
  "isSoftwareOathEnabled": true,
  "excludeTargets": [],
  "featureSettings": {
    "displayAppInformationRequiredState": {
      "state": "default",
      "includeTarget": {
        "targetType": "group",
        "id": "all_users"
      },
      "excludeTarget": {
        "targetType": "group",
        "id": "00000000-0000-0000-0000-000000000000"
      }
    },
    "displayLocationInformationRequiredState": {
      "state": "default",
      "includeTarget": {
        "targetType": "group",
        "id": "all_users"
      },
      "excludeTarget": {
        "targetType": "group",
        "id": "00000000-0000-0000-0000-000000000000"
      }
    }
  },
  "includeTargets@odata.context": "https://graph.microsoft.com/v1.0/$metadata#policies/authenticationMethodsPolicy/authenticationMethodConfigurations('MicrosoftAuthenticator')/microsoft.graph.microsoftAuthenticatorAuthenticationMethodConfiguration/includeTargets",
  "includeTargets": [
    {
      "targetType": "group",
      "id": "all_users",
      "isRegistrationRequired": false,
      "authenticationMode": "any"
    }
  ]
}
