{
  "identityVersion": "6.6.15968",
  "@odata.type": "#microsoft.graph.windowsMobileMSI",
  "supersededAppCount": 0,
  "roleScopeTagIds": [
    "0"
  ],
  "displayName": "Zoom Workplace (ARM64)",
  "committedContentVersion": "1",
  "uploadState": 1,
  "fileName": "ZoomInstallerFull.msi",
  "supersedingAppCount": 0,
  "notes": "",
  "publisher": "Zoom",
  "ignoreVersionDetection": false,
  "isFeatured": false,
  "id": "af2e98bd-f4d0-4ea1-bd6f-ca62449437cd",
  "privacyInformationUrl": "",
  "useDeviceContext": true,
  "informationUrl": null,
  "owner": "",
  "size": 130213440,
  "productCode": "{A5AB9ED2-92C7-4507-914A-47EA2714FBC2}",
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps/$entity",
  "largeIcon": null,
  "createdDateTime": "2025-09-25T18:44:57.5639986Z",
  "developer": "",
  "publishingState": "published",
  "commandLine": "/qn /norestart",
  "dependentAppCount": 0,
  "isAssigned": false,
  "lastModifiedDateTime": "2025-09-25T18:44:57.5639986Z",
  "productVersion": "6.6.15968",
  "description": "Zoom Workplace (ARM64)"
}
