{
  "@odata.context": "https://graph.microsoft.com/v1.0/$metadata#authenticationMethodConfigurations/$entity",
  "@odata.type": "#microsoft.graph.fido2AuthenticationMethodConfiguration",
  "id": "Fido2",
  "state": "disabled",
  "isSelfServiceRegistrationAllowed": true,
  "isAttestationEnforced": false,
  "excludeTargets": [],
  "keyRestrictions": {
    "isEnforced": false,
    "enforcementType": "block",
    "aaGuids": []
  },
  "includeTargets@odata.context": "https://graph.microsoft.com/v1.0/$metadata#policies/authenticationMethodsPolicy/authenticationMethodConfigurations('Fido2')/microsoft.graph.fido2AuthenticationMethodConfiguration/includeTargets",
  "includeTargets": [
    {
      "targetType": "group",
      "id": "all_users",
      "isRegistrationRequired": false
    }
  ]
}
