{
  "earlyLaunchAntiMalwareDriverEnabled": false,
  "passwordBlockSimple": false,
  "defenderVersion": null,
  "codeIntegrityEnabled": false,
  "defenderEnabled": false,
  "signatureOutOfDate": false,
  "memoryIntegrityEnabled": false,
  "bitLockerEnabled": true,
  "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
  "version": 1,
  "activeFirewallRequired": false,
  "wslDistributions": [],
  "validOperatingSystemBuildRanges": [],
  "passwordRequiredToUnlockFromIdle": false,
  "passwordExpirationDays": null,
  "lastModifiedDateTime": "2025-09-28T00:55:35.2837982Z",
  "deviceCompliancePolicyScript": null,
  "deviceThreatProtectionEnabled": true,
  "passwordPreviousPasswordBlockCount": null,
  "displayName": "Win Compliant – BitLocker + Secure Boot + MDE Healthy",
  "configurationManagerComplianceRequired": false,
  "firmwareProtectionEnabled": false,
  "deviceThreatProtectionRequiredSecurityLevel": "secured",
  "mobileOsMinimumVersion": null,
  "virtualizationBasedSecurityEnabled": false,
  "passwordMinimumLength": null,
  "passwordRequiredType": "deviceDefault",
  "secureBootEnabled": true,
  "passwordMinutesOfInactivityBeforeLock": null,
  "description": "Marks Windows devices compliant only if disk encryption, secure-boot & Defender for Endpoint health are all good.",
  "rtpEnabled": false,
  "mobileOsMaximumVersion": null,
  "createdDateTime": "2025-09-28T00:55:35.2837982Z",
  "osMaximumVersion": null,
  "roleScopeTagIds": [
    "0"
  ],
  "storageRequireEncryption": false,
  "antivirusRequired": false,
  "antiSpywareRequired": false,
  "passwordRequired": false,
  "tpmRequired": false,
  "id": "1f858fcf-72f7-4db6-8a75-fb293d41e861",
  "passwordMinimumCharacterSetCount": null,
  "osMinimumVersion": null,
  "requireHealthyDeviceReport": false,
  "kernelDmaProtectionEnabled": false
}
