{
  "driversExcluded": false,
  "deliveryOptimizationMode": "userDefined",
  "featureUpdatesPaused": false,
  "scheduleImminentRestartWarningInMinutes": null,
  "userWindowsUpdateScanAccess": "enabled",
  "deadlineForFeatureUpdatesInDays": 14,
  "engagedRestartSnoozeScheduleInDays": null,
  "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "autoRestartNotificationDismissal": "notConfigured",
  "qualityUpdatesDeferralPeriodInDays": 7,
  "microsoftUpdateServiceAllowed": true,
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "version": 1,
  "skipChecksBeforeRestart": false,
  "businessReadyUpdatesOnly": "userDefined",
  "updateWeeks": null,
  "userPauseAccess": "enabled",
  "lastModifiedDateTime": "2025-09-26T19:31:09.9823445Z",
  "qualityUpdatesWillBeRolledBack": null,
  "prereleaseFeatures": "userDefined",
  "qualityUpdatesPaused": false,
  "featureUpdatesWillBeRolledBack": null,
  "displayName": "Broad Update Ring",
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "automaticUpdateMode": "autoInstallAndRebootAtMaintenanceTime",
  "installationSchedule": {
    "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
    "activeHoursEnd": "17:00:00.0000000",
    "activeHoursStart": "08:00:00.0000000"
  },
  "scheduleRestartWarningInHours": null,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "qualityUpdatesPauseStartDate": null,
  "engagedRestartTransitionScheduleInDays": null,
  "featureUpdatesDeferralPeriodInDays": 30,
  "description": "Broad Update Ring",
  "engagedRestartDeadlineInDays": null,
  "allowWindows11Upgrade": false,
  "createdDateTime": "2025-09-26T19:31:09.9823445Z",
  "roleScopeTagIds": [
    "0"
  ],
  "featureUpdatesPauseStartDate": null,
  "supportsScopeTags": true,
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackWindowInDays": 10,
  "deadlineGracePeriodInDays": 3,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "id": "ed7b9eae-4ef7-4db1-833f-6b3a8a2e026f",
  "postponeRebootUntilAfterDeadline": false,
  "deadlineForQualityUpdatesInDays": 14,
  "updateNotificationLevel": "defaultNotifications",
  "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z"
}
