{
  "driversExcluded": false,
  "deliveryOptimizationMode": "userDefined",
  "featureUpdatesPaused": false,
  "scheduleImminentRestartWarningInMinutes": null,
  "userWindowsUpdateScanAccess": "enabled",
  "deadlineForFeatureUpdatesInDays": 7,
  "engagedRestartSnoozeScheduleInDays": null,
  "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "autoRestartNotificationDismissal": "notConfigured",
  "qualityUpdatesDeferralPeriodInDays": 0,
  "microsoftUpdateServiceAllowed": true,
  "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
  "version": 1,
  "skipChecksBeforeRestart": false,
  "businessReadyUpdatesOnly": "userDefined",
  "updateWeeks": null,
  "userPauseAccess": "enabled",
  "lastModifiedDateTime": "2025-09-26T19:23:34.8158485Z",
  "qualityUpdatesWillBeRolledBack": null,
  "prereleaseFeatures": "userDefined",
  "qualityUpdatesPaused": false,
  "featureUpdatesWillBeRolledBack": null,
  "displayName": "Pilot Update Ring",
  "deviceManagementApplicabilityRuleDeviceMode": null,
  "automaticUpdateMode": "autoInstallAndRebootAtMaintenanceTime",
  "installationSchedule": {
    "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
    "activeHoursEnd": "17:00:00.0000000",
    "activeHoursStart": "08:00:00.0000000"
  },
  "scheduleRestartWarningInHours": null,
  "deviceManagementApplicabilityRuleOsEdition": null,
  "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
  "qualityUpdatesPauseStartDate": null,
  "engagedRestartTransitionScheduleInDays": null,
  "featureUpdatesDeferralPeriodInDays": 7,
  "description": "Pilot Update Ring",
  "engagedRestartDeadlineInDays": null,
  "allowWindows11Upgrade": false,
  "createdDateTime": "2025-09-26T19:23:34.8158485Z",
  "roleScopeTagIds": [
    "0"
  ],
  "featureUpdatesPauseStartDate": null,
  "supportsScopeTags": true,
  "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
  "featureUpdatesRollbackWindowInDays": 10,
  "deadlineGracePeriodInDays": 2,
  "deviceManagementApplicabilityRuleOsVersion": null,
  "id": "9cbfe3a9-e11f-4428-a979-86879ee72bac",
  "postponeRebootUntilAfterDeadline": false,
  "deadlineForQualityUpdatesInDays": 7,
  "updateNotificationLevel": "defaultNotifications",
  "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z"
}
